# Cadence Genus(TM) Synthesis Solution, Version 21.10-p002_1, built Aug 20 2021 10:13:13

# Date: Thu Jan 23 16:53:14 2025
# Host: vlsicadclient07 (x86_64 w/Linux 3.10.0-957.el7.x86_64) (6cores*12cpus*1physical cpu*Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz 12288KB)
# OS:   Red Hat Enterprise Linux Workstation release 7.6 (Maipo)

set_attr init_lib_search_path ../lib/
set_attr hdl_search_path /home/vlsiuser21/Desktop/aditya_Friday/files_rtl3gds/Cadence_design_database_45nm/Cadence_design_database_45nm/lib
set_attr library slow_vdd1v0_basicCells.lib
read_hdl /home/vlsiuser21/Desktop/aditya_Friday/files_rtl3gds/Cadence_design_database_45nm/Cadence_design_database_45nm/rtl/t1c_riscv_cpu_rewritten.v
set_top_module /home/vlsiuser21/Desktop/aditya_Friday/files_rtl3gds/Cadence_design_database_45nm/Cadence_design_database_45nm/rtl/t1c_riscv_cpu_rewritten.v
elaborate
read_hdl /home/vlsiuser21/Desktop/aditya_Friday/files_rtl3gds/Cadence_design_database_45nm/Cadence_design_database_45nm/rtl/t1c_riscv_cpu_rewritten.v
elaborate
elaborate
set_attr init_lib_search_path ../lib/
elaborate
read_hdl /home/vlsiuser21/Desktop/aditya_Friday/files_rtl3gds/Cadence_design_database_45nm/Cadence_design_database_45nm/rtl/t1c_riscv_cpu_rewritten.v
elaborate
gui_show
