create_clock -name clk -period 10 -waveform {0 5} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clocks "clk"]
set_clock_transition -fall 0.1 [get_clocks "clk"]
set_clock_uncertainty 0.01 [get_clocks "clk"]
set_input_delay -max 1.0 -min 0.8 [get_ports { clk reset Ext_MemWrite Ext_DataAdr Ext_WriteData }] -clock [get_clocks "clk"]
set_output_delay -max 1.0  -min 0.8 [get_ports { PC MemWrite WriteData ReadData Result DataAdr}] -clock [get_clocks "clk"]
set_load 0.05 [get_ports {PC MemWrite WriteData ReadData Result DataAdr}]
set_driving_cell -lib_cell BUF_X4 -library std_lib [get_ports {clk reset Ext_MemWrite Ext_DataAdr Ext_WriteData}]
set_input_transition 0.2 [get_ports {clk reset Ext_MemWrite Ext_DataAdr Ext_WriteData}]
set_output_transition 0.3 [get_ports {PC MemWrite WriteData ReadData Result DataAdr}]