# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.13-s073_1 on Wed Feb 05 16:42:31 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design t1c_riscv_cpu

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.05 [get_ports MemWrite]
set_load -pin_load 0.05 [get_ports {WriteData[31]}]
set_load -pin_load 0.05 [get_ports {WriteData[30]}]
set_load -pin_load 0.05 [get_ports {WriteData[29]}]
set_load -pin_load 0.05 [get_ports {WriteData[28]}]
set_load -pin_load 0.05 [get_ports {WriteData[27]}]
set_load -pin_load 0.05 [get_ports {WriteData[26]}]
set_load -pin_load 0.05 [get_ports {WriteData[25]}]
set_load -pin_load 0.05 [get_ports {WriteData[24]}]
set_load -pin_load 0.05 [get_ports {WriteData[23]}]
set_load -pin_load 0.05 [get_ports {WriteData[22]}]
set_load -pin_load 0.05 [get_ports {WriteData[21]}]
set_load -pin_load 0.05 [get_ports {WriteData[20]}]
set_load -pin_load 0.05 [get_ports {WriteData[19]}]
set_load -pin_load 0.05 [get_ports {WriteData[18]}]
set_load -pin_load 0.05 [get_ports {WriteData[17]}]
set_load -pin_load 0.05 [get_ports {WriteData[16]}]
set_load -pin_load 0.05 [get_ports {WriteData[15]}]
set_load -pin_load 0.05 [get_ports {WriteData[14]}]
set_load -pin_load 0.05 [get_ports {WriteData[13]}]
set_load -pin_load 0.05 [get_ports {WriteData[12]}]
set_load -pin_load 0.05 [get_ports {WriteData[11]}]
set_load -pin_load 0.05 [get_ports {WriteData[10]}]
set_load -pin_load 0.05 [get_ports {WriteData[9]}]
set_load -pin_load 0.05 [get_ports {WriteData[8]}]
set_load -pin_load 0.05 [get_ports {WriteData[7]}]
set_load -pin_load 0.05 [get_ports {WriteData[6]}]
set_load -pin_load 0.05 [get_ports {WriteData[5]}]
set_load -pin_load 0.05 [get_ports {WriteData[4]}]
set_load -pin_load 0.05 [get_ports {WriteData[3]}]
set_load -pin_load 0.05 [get_ports {WriteData[2]}]
set_load -pin_load 0.05 [get_ports {WriteData[1]}]
set_load -pin_load 0.05 [get_ports {WriteData[0]}]
set_load -pin_load 0.05 [get_ports {DataAdr[31]}]
set_load -pin_load 0.05 [get_ports {DataAdr[30]}]
set_load -pin_load 0.05 [get_ports {DataAdr[29]}]
set_load -pin_load 0.05 [get_ports {DataAdr[28]}]
set_load -pin_load 0.05 [get_ports {DataAdr[27]}]
set_load -pin_load 0.05 [get_ports {DataAdr[26]}]
set_load -pin_load 0.05 [get_ports {DataAdr[25]}]
set_load -pin_load 0.05 [get_ports {DataAdr[24]}]
set_load -pin_load 0.05 [get_ports {DataAdr[23]}]
set_load -pin_load 0.05 [get_ports {DataAdr[22]}]
set_load -pin_load 0.05 [get_ports {DataAdr[21]}]
set_load -pin_load 0.05 [get_ports {DataAdr[20]}]
set_load -pin_load 0.05 [get_ports {DataAdr[19]}]
set_load -pin_load 0.05 [get_ports {DataAdr[18]}]
set_load -pin_load 0.05 [get_ports {DataAdr[17]}]
set_load -pin_load 0.05 [get_ports {DataAdr[16]}]
set_load -pin_load 0.05 [get_ports {DataAdr[15]}]
set_load -pin_load 0.05 [get_ports {DataAdr[14]}]
set_load -pin_load 0.05 [get_ports {DataAdr[13]}]
set_load -pin_load 0.05 [get_ports {DataAdr[12]}]
set_load -pin_load 0.05 [get_ports {DataAdr[11]}]
set_load -pin_load 0.05 [get_ports {DataAdr[10]}]
set_load -pin_load 0.05 [get_ports {DataAdr[9]}]
set_load -pin_load 0.05 [get_ports {DataAdr[8]}]
set_load -pin_load 0.05 [get_ports {DataAdr[7]}]
set_load -pin_load 0.05 [get_ports {DataAdr[6]}]
set_load -pin_load 0.05 [get_ports {DataAdr[5]}]
set_load -pin_load 0.05 [get_ports {DataAdr[4]}]
set_load -pin_load 0.05 [get_ports {DataAdr[3]}]
set_load -pin_load 0.05 [get_ports {DataAdr[2]}]
set_load -pin_load 0.05 [get_ports {DataAdr[1]}]
set_load -pin_load 0.05 [get_ports {DataAdr[0]}]
set_load -pin_load 0.05 [get_ports {ReadData[31]}]
set_load -pin_load 0.05 [get_ports {ReadData[30]}]
set_load -pin_load 0.05 [get_ports {ReadData[29]}]
set_load -pin_load 0.05 [get_ports {ReadData[28]}]
set_load -pin_load 0.05 [get_ports {ReadData[27]}]
set_load -pin_load 0.05 [get_ports {ReadData[26]}]
set_load -pin_load 0.05 [get_ports {ReadData[25]}]
set_load -pin_load 0.05 [get_ports {ReadData[24]}]
set_load -pin_load 0.05 [get_ports {ReadData[23]}]
set_load -pin_load 0.05 [get_ports {ReadData[22]}]
set_load -pin_load 0.05 [get_ports {ReadData[21]}]
set_load -pin_load 0.05 [get_ports {ReadData[20]}]
set_load -pin_load 0.05 [get_ports {ReadData[19]}]
set_load -pin_load 0.05 [get_ports {ReadData[18]}]
set_load -pin_load 0.05 [get_ports {ReadData[17]}]
set_load -pin_load 0.05 [get_ports {ReadData[16]}]
set_load -pin_load 0.05 [get_ports {ReadData[15]}]
set_load -pin_load 0.05 [get_ports {ReadData[14]}]
set_load -pin_load 0.05 [get_ports {ReadData[13]}]
set_load -pin_load 0.05 [get_ports {ReadData[12]}]
set_load -pin_load 0.05 [get_ports {ReadData[11]}]
set_load -pin_load 0.05 [get_ports {ReadData[10]}]
set_load -pin_load 0.05 [get_ports {ReadData[9]}]
set_load -pin_load 0.05 [get_ports {ReadData[8]}]
set_load -pin_load 0.05 [get_ports {ReadData[7]}]
set_load -pin_load 0.05 [get_ports {ReadData[6]}]
set_load -pin_load 0.05 [get_ports {ReadData[5]}]
set_load -pin_load 0.05 [get_ports {ReadData[4]}]
set_load -pin_load 0.05 [get_ports {ReadData[3]}]
set_load -pin_load 0.05 [get_ports {ReadData[2]}]
set_load -pin_load 0.05 [get_ports {ReadData[1]}]
set_load -pin_load 0.05 [get_ports {ReadData[0]}]
set_load -pin_load 0.05 [get_ports {PC[31]}]
set_load -pin_load 0.05 [get_ports {PC[30]}]
set_load -pin_load 0.05 [get_ports {PC[29]}]
set_load -pin_load 0.05 [get_ports {PC[28]}]
set_load -pin_load 0.05 [get_ports {PC[27]}]
set_load -pin_load 0.05 [get_ports {PC[26]}]
set_load -pin_load 0.05 [get_ports {PC[25]}]
set_load -pin_load 0.05 [get_ports {PC[24]}]
set_load -pin_load 0.05 [get_ports {PC[23]}]
set_load -pin_load 0.05 [get_ports {PC[22]}]
set_load -pin_load 0.05 [get_ports {PC[21]}]
set_load -pin_load 0.05 [get_ports {PC[20]}]
set_load -pin_load 0.05 [get_ports {PC[19]}]
set_load -pin_load 0.05 [get_ports {PC[18]}]
set_load -pin_load 0.05 [get_ports {PC[17]}]
set_load -pin_load 0.05 [get_ports {PC[16]}]
set_load -pin_load 0.05 [get_ports {PC[15]}]
set_load -pin_load 0.05 [get_ports {PC[14]}]
set_load -pin_load 0.05 [get_ports {PC[13]}]
set_load -pin_load 0.05 [get_ports {PC[12]}]
set_load -pin_load 0.05 [get_ports {PC[11]}]
set_load -pin_load 0.05 [get_ports {PC[10]}]
set_load -pin_load 0.05 [get_ports {PC[9]}]
set_load -pin_load 0.05 [get_ports {PC[8]}]
set_load -pin_load 0.05 [get_ports {PC[7]}]
set_load -pin_load 0.05 [get_ports {PC[6]}]
set_load -pin_load 0.05 [get_ports {PC[5]}]
set_load -pin_load 0.05 [get_ports {PC[4]}]
set_load -pin_load 0.05 [get_ports {PC[3]}]
set_load -pin_load 0.05 [get_ports {PC[2]}]
set_load -pin_load 0.05 [get_ports {PC[1]}]
set_load -pin_load 0.05 [get_ports {PC[0]}]
set_load -pin_load 0.05 [get_ports {Result[31]}]
set_load -pin_load 0.05 [get_ports {Result[30]}]
set_load -pin_load 0.05 [get_ports {Result[29]}]
set_load -pin_load 0.05 [get_ports {Result[28]}]
set_load -pin_load 0.05 [get_ports {Result[27]}]
set_load -pin_load 0.05 [get_ports {Result[26]}]
set_load -pin_load 0.05 [get_ports {Result[25]}]
set_load -pin_load 0.05 [get_ports {Result[24]}]
set_load -pin_load 0.05 [get_ports {Result[23]}]
set_load -pin_load 0.05 [get_ports {Result[22]}]
set_load -pin_load 0.05 [get_ports {Result[21]}]
set_load -pin_load 0.05 [get_ports {Result[20]}]
set_load -pin_load 0.05 [get_ports {Result[19]}]
set_load -pin_load 0.05 [get_ports {Result[18]}]
set_load -pin_load 0.05 [get_ports {Result[17]}]
set_load -pin_load 0.05 [get_ports {Result[16]}]
set_load -pin_load 0.05 [get_ports {Result[15]}]
set_load -pin_load 0.05 [get_ports {Result[14]}]
set_load -pin_load 0.05 [get_ports {Result[13]}]
set_load -pin_load 0.05 [get_ports {Result[12]}]
set_load -pin_load 0.05 [get_ports {Result[11]}]
set_load -pin_load 0.05 [get_ports {Result[10]}]
set_load -pin_load 0.05 [get_ports {Result[9]}]
set_load -pin_load 0.05 [get_ports {Result[8]}]
set_load -pin_load 0.05 [get_ports {Result[7]}]
set_load -pin_load 0.05 [get_ports {Result[6]}]
set_load -pin_load 0.05 [get_ports {Result[5]}]
set_load -pin_load 0.05 [get_ports {Result[4]}]
set_load -pin_load 0.05 [get_ports {Result[3]}]
set_load -pin_load 0.05 [get_ports {Result[2]}]
set_load -pin_load 0.05 [get_ports {Result[1]}]
set_load -pin_load 0.05 [get_ports {Result[0]}]
set_clock_gating_check -setup 0.0 
set_input_transition 0.2 [get_ports clk]
set_input_transition 0.2 [get_ports reset]
set_input_transition 0.2 [get_ports Ext_MemWrite]
set_input_transition 0.2 [get_ports {Ext_WriteData[31]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[30]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[29]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[28]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[27]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[26]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[25]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[24]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[23]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[22]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[21]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[20]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[19]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[18]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[17]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[16]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[15]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[14]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[13]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[12]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[11]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[10]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[9]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[8]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[7]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[6]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[5]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[4]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[3]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[2]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[1]}]
set_input_transition 0.2 [get_ports {Ext_WriteData[0]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[31]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[30]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[29]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[28]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[27]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[26]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[25]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[24]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[23]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[22]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[21]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[20]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[19]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[18]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[17]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[16]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[15]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[14]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[13]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[12]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[11]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[10]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[9]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[8]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[7]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[6]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[5]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[4]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[3]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[2]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[1]}]
set_input_transition 0.2 [get_ports {Ext_DataAdr[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_clocks clk]
set_clock_uncertainty -hold 0.01 [get_clocks clk]
